//
//  Common.swift
//  jianzhiapp
//
//  Created by 殷义军 on 2020/5/21.
//  Copyright © 2020 殷义军. All rights reserved.
//

import UIKit
import Foundation


let kNavigationBarH : CGFloat = 44
let kTabbarH : CGFloat = 44
let bottomSafeAreaHeight =  UIApplication.shared.windows.last?.safeAreaInsets.bottom ?? 0.0;
let kScreenW = UIScreen.main.bounds.width
let kScreenH = UIScreen.main.bounds.height

class JobData {
    
}

class Common{
    var GongZuoXinXis:[Gongzuoxinxi] = []
//    var JobOffersdata: [JobOffers] = []
    var kStatusBarH : CGFloat = 20
    var userid = ""
    var dangqiancity = "杭州"
    
    var KXinagH: CGFloat = 4353
    var citys:[String:[String]] = ["hot":["北京市","上海市","广州市","深圳市","杭州市","重庆市"],"D": ["大同市", "大连市", "丹东市", "大庆市", "大兴安岭地区", "东营市", "德州市", "东莞市", "儋州市", "东方市", "定安县", "德阳市", "达州市", "大理白族自治州", "德宏傣族景颇族自治州", "迪庆藏族自治州", "定西市"], "B": ["北京市", "保定市", "包头市", "巴彦淖尔市", "本溪市", "白山市", "白城市", "蚌埠市", "亳州市", "滨州市", "北海市", "百色市", "白沙黎族自治县", "保亭黎族苗族自治县", "巴中市", "毕节市", "保山市", "宝鸡市", "白银市", "博尔塔拉蒙古自治州", "巴音郭楞蒙古自治州"], "W": ["乌海市", "乌兰察布市", "无锡市", "温州市", "芜湖市", "潍坊市", "威海市", "武汉市", "梧州市", "五指山市", "文昌市", "万宁市", "文山壮族苗族自治州", "渭南市", "武威市", "吴忠市", "乌鲁木齐市", "五家渠市"], "T": ["天津市", "唐山市", "太原市", "通辽市", "铁岭市", "通化市", "泰州市", "台州市", "铜陵市", "泰安市", "天门市", "屯昌县", "铜仁市", "铜川市", "天水市", "吐鲁番市", "塔城地区", "图木舒克市", "铁门关市"], "F": ["抚顺市", "阜新市", "阜阳市", "福州市", "抚州市", "佛山市", "防城港市"], "Y": ["阳泉市", "运城市", "营口市", "延边朝鲜族自治州", "伊春市", "盐城市", "扬州市", "鹰潭市", "宜春市", "烟台市", "宜昌市", "岳阳市", "益阳市", "永州市", "阳江市", "云浮市", "玉林市", "宜宾市", "雅安市", "玉溪市", "延安市", "榆林市", "玉树藏族自治州", "银川市", "伊犁哈萨克自治州"], "X": ["邢台市", "忻州市", "兴安盟", "锡林郭勒盟", "徐州市", "宣城市", "新余市", "新乡市", "许昌市", "信阳市", "襄阳市", "孝感市", "咸宁市", "仙桃市", "湘潭市", "湘西土家族苗族自治州", "西双版纳傣族自治州", "西安市", "咸阳市", "西宁市"], "L": ["廊坊市", "临汾市", "吕梁市", "辽阳市", "辽源市", "连云港市", "丽水市", "六安市", "龙岩市", "临沂市", "聊城市", "洛阳市", "漯河市", "娄底市", "柳州市", "来宾市", "临高县", "乐东黎族自治县", "陵水黎族自治县", "泸州市", "乐山市", "凉山彝族自治州", "六盘水市", "丽江市", "临沧市", "拉萨市", "林芝市", "兰州市", "陇南市", "临夏回族自治州"], "S": ["石家庄市", "朔州市", "沈阳市", "四平市", "松原市", "双鸭山市", "绥化市", "上海市", "苏州市", "宿迁市", "绍兴市", "宿州市", "厦门市", "三明市", "上饶市", "三门峡市", "商丘市", "十堰市", "随州市", "神农架林区", "邵阳市", "韶关市", "深圳市", "汕头市", "汕尾市", "三亚市", "三沙市", "遂宁市", "山南市", "商洛市", "石嘴山市", "石河子市"], "Q": ["秦皇岛市", "齐齐哈尔市", "七台河市", "衢州市", "泉州市", "青岛市", "潜江市", "清远市", "钦州市", "琼海市", "琼中黎族苗族自治县", "黔西南布依族苗族自治州", "黔东南苗族侗族自治州", "黔南布依族苗族自治州", "曲靖市", "庆阳市"], "C": ["承德市", "沧州市", "赤峰市", "朝阳市", "常州市", "滁州市", "池州市", "常德市", "郴州市", "潮州市", "崇左市", "澄迈县", "昌江黎族自治县", "重庆市", "成都市", "楚雄彝族自治州", "昌都市", "昌吉回族自治州"], "N": ["南京市", "南通市", "宁波市", "南平市", "宁德市", "南昌市", "南阳市", "南宁市", "内江市", "南充市", "怒江傈僳族自治州", "那曲市"], "J": ["晋城市", "晋中市", "锦州市", "吉林市", "鸡西市", "佳木斯市", "嘉兴市", "金华市", "景德镇市", "九江市", "吉安市", "济南市", "济宁市", "焦作市", "济源市", "荆门市", "荆州市", "江门市", "揭阳市", "嘉峪关市", "金昌市", "酒泉市"], "G": ["赣州市", "广州市", "桂林市", "贵港市", "广元市", "广安市", "甘孜藏族自治州", "贵阳市", "甘南藏族自治州", "果洛藏族自治州", "固原市"], "K": ["开封市", "昆明市", "克拉玛依市", "克孜勒苏柯尔克孜自治州", "喀什地区"], "E": ["鄂尔多斯市", "鄂州市", "恩施土家族苗族自治州"], "R": [], "Z": ["张家口市", "长治市", "长春市", "镇江市", "舟山市", "漳州市", "淄博市", "枣庄市", "郑州市", "周口市", "驻马店市", "长沙市", "株洲市", "张家界市", "珠海市", "湛江市", "肇庆市", "中山市", "自贡市", "资阳市", "遵义市", "昭通市", "张掖市", "中卫市"], "H": ["邯郸市", "衡水市", "呼和浩特市", "呼伦贝尔市", "葫芦岛市", "哈尔滨市", "鹤岗市", "黑河市", "淮安市", "杭州市", "湖州市", "合肥市", "淮南市", "淮北市", "黄山市", "菏泽市", "鹤壁市", "黄石市", "黄冈市", "衡阳市", "怀化市", "惠州市", "河源市", "贺州市", "河池市", "海口市", "红河哈尼族彝族自治州", "汉中市", "海东市", "海北藏族自治州", "黄南藏族自治州", "海南藏族自治州", "海西蒙古族藏族自治州", "哈密市", "和田地区"], "A": ["阿拉善盟", "鞍山市", "安庆市", "安阳市", "阿坝藏族羌族自治州", "安顺市", "阿里地区", "安康市", "阿克苏地区", "阿勒泰地区", "阿拉尔市"], "M": ["牡丹江市", "马鞍山市", "茂名市", "梅州市", "绵阳市", "眉山市"], "P": ["盘锦市", "莆田市", "萍乡市", "平顶山市", "濮阳市", "攀枝花市", "普洱市", "平凉市"]]
    
    
}
